README.org
#+OPTIONS: toc:t
# This is the actual README for the repo. README.md is generated by [C-c C-e m m].

* Installing and Contributing

*** Dependencies

    * [[https://www.python.org/downloads/][Python 3.7+]] :: Python 3 would technically be good enough but 3.7 is the
         version the virtual environment happens to be installed to.
    * [[https://pip.pypa.io/en/stable/installing/][pip]] :: Be sure that you install a version compatible with Python 3.7;
         depending on your system package manager, this may be under the `pip3`
         name (with `pip` defaulting to Python 2).
    * [[https://pipenv.readthedocs.io/en/latest/install/][pipenv]] :: This allows you to isolate this project's dependencies in its
         own virtual environment, without affecting your main Python
         installation.

* How to /Puflantu/

*** General Language Elements

    Word order in Puflantu is Subject-Object-Verb.

#+BEGIN_EXAMPLE
Alisu  Puflantu    catub.
Alice  Perflontus  speak-she.
#+END_EXAMPLE

| Alisu Puflantu catub. | Alice Perflontus speak-she. |

| Alisu | Puflantu   | catub.     |
| Alice | Perflontus | speak-she. |
