README.md

# Table of Contents

1.  [Installing and Contributing](#org6070e31)
    1.  [Dependencies](#orga42cdd7)
2.  [How to *Puflantu*](#orga23c99b)
    1.  [General Language Elements](#org3a55908)



<a id="org6070e31"></a>

# Installing and Contributing


<a id="orga42cdd7"></a>

## Dependencies

-   **[Python 3.7+](https://www.python.org/downloads/):** Python 3 would technically be good enough but 3.7 is the
    version the virtual environment happens to be installed to.
-   **[pip](https://pip.pypa.io/en/stable/installing/):** Be sure that you install a version compatible with Python 3.7;
    depending on your system package manager, this may be under the \`pip3\`
    name (with \`pip\` defaulting to Python 2).
-   **[pipenv](https://pipenv.readthedocs.io/en/latest/install/):** This allows you to isolate this project's dependencies in its
    own virtual environment, without affecting your main Python
    installation.


<a id="orga23c99b"></a>

# How to *Puflantu*


<a id="org3a55908"></a>

## General Language Elements

Word order in Puflantu is Subject-Object-Verb.

    Alisu  Puflantu    catub.
    Alice  Perflontus  speak-she.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Alisu Puflantu catub.</td>
<td class="org-left">Alice Perflontus speak-she.</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Alisu</td>
<td class="org-left">Puflantu</td>
<td class="org-left">catub.</td>
</tr>


<tr>
<td class="org-left">Alice</td>
<td class="org-left">Perflontus</td>
<td class="org-left">speak-she.</td>
</tr>
</tbody>
</table>
